#Вывести все нечетные числа от 5 до 55
a = 5
while a <= 55:
    print(a, end=' ')
    a += 2
