#Вывести сколько раз встречается символ С
a = input()
b = 0
for d in a:
    if d == 'C':
        b += 1
print (b)